Revit 2026 API

# ScheduleDefinitionShowGrandTotalTitle Property

---

Indicates if the grand total row should display a title.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ShowGrandTotalTitle { get; set; }
```
```vb
Public Property ShowGrandTotalTitle As Boolean
	Get
	Set
```
```cpp
public:
property bool ShowGrandTotalTitle {
	bool get ();
	void set (bool value);
}
```
```fsharp
member ShowGrandTotalTitle : bool with get, set
```

#### Property Value

Boolean True if a title should be displayed, false otherwise.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: Display of a grand total row is not enabled. |

The title consists of the text "Grand total".

ShowGrandTotalTitle can only be enabled if ShowGrandTotal is enabled.

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace